<a href="https://colab.research.google.com/github/MadhurimaPaul-87/Codebasics/blob/main/Naive_Bayes_Classifier_part_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd

In [6]:
df = pd.read_csv("https://raw.githubusercontent.com/codebasics/py/master/ML/14_naive_bayes/titanic.csv")

In [7]:
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

In [8]:
df = df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1)
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [9]:
target = df['Survived']
inputs = df.drop(['Survived'],axis=1)

In [10]:
from sklearn.preprocessing import LabelEncoder

In [11]:
le_sex = LabelEncoder()

In [12]:
inputs['Sex_n'] = le_sex.fit_transform(inputs['Sex'])

In [13]:
inputs.head()

   Pclass     Sex   Age     Fare  Sex_n
0       3    male  22.0   7.2500      1
1       1  female  38.0  71.2833      0
2       3  female  26.0   7.9250      0
3       1  female  35.0  53.1000      0
4       3    male  35.0   8.0500      1

In [14]:
inputs=inputs.drop(['Sex'],axis=1)
inputs.head()

   Pclass   Age     Fare  Sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [15]:
inputs['Age'].isna().sum

<bound method Series.sum of 0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool>

In [16]:
mean_age = inputs['Age'].mean()

In [18]:
inputs['Age']=inputs['Age'].fillna(mean_age)

In [19]:
inputs.head()

   Pclass   Age     Fare  Sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [21]:
from sklearn.model_selection import train_test_split

In [22]:
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size = 0.2)

In [23]:
len(X_train)

712

In [24]:
from sklearn.naive_bayes import GaussianNB

In [25]:
model = GaussianNB()
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [26]:
model.score(X_test,y_test)

0.7541899441340782

In [27]:
y_test.head(10)

232    0
444    1
370    1
87     0
371    0
360    0
838    1
361    0
610    0
664    1
Name: Survived, dtype: int64

In [29]:
model.predict(X_test[0:10])

array([0, 0, 0, 0, 0, 0, 0, 0, 1, 0])

In [31]:
model.predict_proba(X_test[0:10])

array([[0.91451558, 0.08548442],
       [0.9689575 , 0.0310425 ],
       [0.61843684, 0.38156316],
       [0.96894654, 0.03105346],
       [0.96323252, 0.03676748],
       [0.96811111, 0.03188889],
       [0.93948599, 0.06051401],
       [0.92595356, 0.07404644],
       [0.44583302, 0.55416698],
       [0.96489238, 0.03510762]])